// Gregory Morse

/*

Take Control of Your System

Verify all kernel API calls are not hooked
Verify all ntdll.dll and underneath kernel Read+Execute code checksums
Verify PSAPI.dll, tlhelp32.dll, advapi32.dll
Use kernel to dump:
All kernel objects
All processes/threads/modules
All drivers/services
All GDI objects
All User/window objects
All files (including com, lpt, reserved names)
All NTFS alternate data streams
All IFS
All registry keys
All autoruns




*/

// PestRidDlg.h : header file
//

// SymLink info,
// tabs for mutant information
// more handle columns we have more information!!!
// windows security information for objects

#pragma once
#include "afxwin.h"
#include <psapi.h>
#include <tlhelp32.h>
#include <afxtempl.h>
#include "afxcmn.h"
#include <process.h>
#include <winternl.h>
#include <winsvc.h>

#include <stdio.h>
#include <stdarg.h>


#include "devioctl.h"

#include <pshpack4.h>		// allow use in driver and application build!
// 4 byte alignment required for all NT structures

#define MEM_EXECUTE_OPTION_DISABLE  0x1
#define MEM_EXECUTE_OPTION_ENABLE 0x2

#define OBJ_INHERIT              Ox00000002L 
#define OBJ_PERMANENT            0x00000010L 
#define OBJ_EXCLUSIVE            0x00000020L 
#define OBJ_CASE_INSENSITIVE     0x00000040L 
#define OBJ_OPENIF               0x00000080L 
#define OBJ_VALID_ATTRIBUTES     0x000000F2L 

#define OBJ_NAME_PATH_SEPARATOR ((WCHAR)L'\\')

#define DIRECTORY_QUERY               (0x0001) 
#define DIRECTORY_TRAVERSE            (0x0002) 
#define DIRECTORY_CREATE_OBJECT       (0x0004) 
#define DIRECTORY_CREATE_SUBDIRECTORY (0x0008) 
#define DIRECTORY_ALL_ACCESS          (STANDARD_RIGHTS_REQUIRED | 0xF) 

typedef enum _DIRECTORYINFOCLASS { 
    ObjectArray, 
    ObjectByOne 
} DIRECTORYINFOCLASS, *PDIRECTORYINFOCLASS; 

#define QUERY_DIRECTORY_BUF_SIZE 0x200 

typedef struct _OBJECT_NAMETYPE_INFO { 
	UNICODE_STRING   ObjectName; 
    UNICODE_STRING   ObjectType; 
} OBJECT_NAMETYPE_INFO, *POBJECT_NAMETYPE_INFO; 

typedef struct _CLIENT_ID {
    HANDLE UniqueProcess;
    HANDLE UniqueThread;
} CLIENT_ID;
typedef CLIENT_ID *PCLIENT_ID;
typedef DWORD KWAIT_REASON;
typedef LONG KPRIORITY;
typedef struct _VM_COUNTERS {
    SIZE_T PeakVirtualSize;
    SIZE_T VirtualSize;
    ULONG PageFaultCount;
    SIZE_T PeakWorkingSetSize;
    SIZE_T WorkingSetSize;
    SIZE_T QuotaPeakPagedPoolUsage;
    SIZE_T QuotaPagedPoolUsage;
    SIZE_T QuotaPeakNonPagedPoolUsage;
    SIZE_T QuotaNonPagedPoolUsage;
    SIZE_T PagefileUsage;
    SIZE_T PeakPagefileUsage;
} VM_COUNTERS;
typedef VM_COUNTERS *PVM_COUNTERS;

typedef struct _SYSTEM_THREAD
    {
/*000*/ FILETIME   ftKernelTime;   // 100 nsec units
/*008*/ FILETIME   ftUserTime;    // 100 nsec units
/*010*/ FILETIME   ftCreateTime;   // relative to 01-01-1601
/*018*/ DWORD    dWaitTime;
/*01C*/ PVOID    pStartAddress;
/*020*/ CLIENT_ID  Cid;        // process/thread ids
/*028*/ DWORD    dPriority;
/*02C*/ DWORD    dBasePriority;
/*030*/ DWORD    dContextSwitches;
/*034*/ DWORD    dThreadState;   // 2=running, 5=waiting
/*038*/ KWAIT_REASON WaitReason;
/*03C*/ DWORD    dReserved01;
/*040*/ }
    SYSTEM_THREAD, *PSYSTEM_THREAD;
#define SYSTEM_THREAD_ sizeof (SYSTEM_THREAD)
// -----------------------------------------------------------------
typedef struct _SYSTEM_PROCESS     // common members
    {
/*000*/ DWORD     dNext;      // relative offset
/*004*/ DWORD     dThreadCount;
/*008*/ DWORD     dReserved01;
/*00C*/ DWORD     dReserved02;
/*010*/ DWORD     dReserved03;
/*014*/ DWORD     dReserved04;
/*018*/ DWORD     dReserved05;
/*01C*/ DWORD     dReserved06;
/*020*/ FILETIME    ftCreateTime;  // relative to 01-01-1601
/*028*/ FILETIME    ftUserTime;   // 100 nsec units
/*030*/ FILETIME    ftKernelTime;  // 100 nsec units
/*038*/ UNICODE_STRING usName;
/*040*/ KPRIORITY   BasePriority;
/*044*/ DWORD     dUniqueProcessId;
/*048*/ DWORD     dInheritedFromUniqueProcessId;
/*04C*/ DWORD     dHandleCount;
/*050*/ DWORD     dReserved07;
/*054*/ DWORD     dReserved08;
/*058*/ VM_COUNTERS  VmCounters;   // see ntddk.h
/*084*/ DWORD     dCommitCharge;  // bytes
/*088*/ }
    SYSTEM_PROCESS, *PSYSTEM_PROCESS;
#define SYSTEM_PROCESS_ sizeof (SYSTEM_PROCESS)
// -----------------------------------------------------------------
typedef struct _SYSTEM_PROCESS_NT4   // Windows NT 4.0
    {
/*000*/ SYSTEM_PROCESS Process;     // common members
/*088*/ SYSTEM_THREAD aThreads [1];   // thread array
/*088*/ }
    SYSTEM_PROCESS_NT4, *PSYSTEM_PROCESS_NT4;
#define SYSTEM_PROCESS_NT4_ sizeof (SYSTEM_PROCESS_NT4)
// -----------------------------------------------------------------
typedef struct _SYSTEM_PROCESS_NT5   // Windows 2000
    {
/*000*/ SYSTEM_PROCESS Process;     // common members
/*088*/ IO_COUNTERS  IoCounters;   // see ntddk.h
/*0B8*/ SYSTEM_THREAD aThreads [1];   // thread array
/*0B8*/ }
    SYSTEM_PROCESS_NT5, *PSYSTEM_PROCESS_NT5;
#define SYSTEM_PROCESS_NT5_ sizeof (SYSTEM_PROCESS_NT5)
// -----------------------------------------------------------------
typedef union __SYSTEM_PROCESS_INFORMATION
    {
/*000*/ SYSTEM_PROCESS   Process;
/*000*/ SYSTEM_PROCESS_NT4 Process_NT4;
/*000*/ SYSTEM_PROCESS_NT5 Process_NT5;
/*0B8*/ }
    __SYSTEM_PROCESS_INFORMATION, *__PSYSTEM_PROCESS_INFORMATION;

typedef struct _RTL_DRIVE_LETTER_CURDIR { 
        USHORT Flags; 
        USHORT Length; 
        ULONG TimeStamp; 
        UNICODE_STRING DosPath; 
} RTL_DRIVE_LETTER_CURDIR, *PRTL_DRIVE_LETTER_CURDIR; 

typedef struct _RTL_USER_PROCESS_PARAMETERS { 
        ULONG MaximumLength; // 0x0 
        ULONG Length; 
        ULONG Flags; 
        ULONG DebugFlags; 
        PVOID ConsoleHandle; //0x10
        ULONG ConsoleFlags; 
        HANDLE StdInputHandle; 
        HANDLE StdOutputHandle; 
        HANDLE StdErrorHandle; //0x20
        UNICODE_STRING CurrentDirectoryPath; 
        HANDLE CurrentDirectoryHandle; 
        UNICODE_STRING DllPath; //0x30
        UNICODE_STRING ImagePathName; 
        UNICODE_STRING CommandLine; //0x40
        PVOID Environment;
        ULONG StartingPositionLeft; 
        ULONG StartingPositionTop; //0x50
        ULONG Width; 
        ULONG Height; 
        ULONG CharWidth; 
        ULONG CharHeight; //0x60
        ULONG ConsoleTextAttributes; 
        ULONG WindowFlags; 
        ULONG ShowWindowFlags; 
        UNICODE_STRING WindowTitle; //0x70
        UNICODE_STRING DesktopName; 
        UNICODE_STRING ShellInfo; //0x80
        UNICODE_STRING RuntimeData; 
        RTL_DRIVE_LETTER_CURDIR DLCurrentDirectory[0x20]; //0x90
} RTL_USER_PROCESS_PARAMETERS, *PRTL_USER_PROCESS_PARAMETERS; 

/*typedef enum _PROCESSINFOCLASS { 
    ProcessBasicInformation = 0, 
    ProcessWow64Information = 26 
} PROCESSINFOCLASS; */

typedef struct _SYSTEM_HANDLE_TABLE_ENTRY_INFO {
    USHORT uIdProcess;
    USHORT CreatorBackTraceIndex;
    UCHAR ObjectTypeIndex;
    UCHAR HandleAttributes;
    USHORT Handle;
    PVOID Object;
    ULONG GrantedAccess;
} SYSTEM_HANDLE_TABLE_ENTRY_INFO, *PSYSTEM_HANDLE_TABLE_ENTRY_INFO;

typedef struct _SYSTEM_HANDLE_INFORMATION {
    ULONG uCount;
    SYSTEM_HANDLE_TABLE_ENTRY_INFO Handles[1];
} SYSTEM_HANDLE_INFORMATION, *PSYSTEM_HANDLE_INFORMATION;

typedef struct _OBJECT_NAME_INFORMATION {
	UNICODE_STRING ObjectName;
} OBJECT_NAME_INFORMATION, *POBJECT_NAME_INFORMATION;

typedef enum _POOL_TYPE {
    NonPagedPool,
    PagedPool,
    NonPagedPoolMustSucceed,
    DontUseThisType,
    NonPagedPoolCacheAligned,
