#pragma once

#include <winnt.h>
#include <winternl.h>
#define _NTDEF_
typedef LONG NTSTATUS, *PNTSTATUS;
#include <ntsecapi.h>

#include <winioctl.h>

#define _SETUPAPI_VER _WIN32_WINNT_LONGHORN //_WIN32_WINNT_WINXP
#include <setupapi.h>

#include "Utility.h"
#include "TraceLog.h"

//kernel32
HMODULE PRU_GetModuleHandle(LPCTSTR lpModuleName);
HMODULE PRU_LoadLibrary(LPCTSTR lpLibFileName);
BOOL PRU_FreeLibrary(HMODULE hLibModule);
FARPROC PRU_GetProcAddress(HMODULE hModule, LPCSTR lpProcName);
BOOL PRU_PathFileExists(LPCTSTR pszPath);
BOOL PRU_ExpandEnvironmentStrings(LPCTSTR szPath, CString & ExpandedPath);
BOOL PRU_LaunchProcess(LPCTSTR lpApplicationName, LPTSTR lpCommandLine);
BOOL PRU_DeleteFile(LPCTSTR szFileName);
BOOL PRU_RemoveDirectory(LPCTSTR lpPathName);
BOOL PRU_DeleteFileTree(LPCTSTR szPath);
BOOL PRU_GetWindowsDirectory(CString & Dir);
BOOL PRU_EnumDirectory(LPCTSTR szSearchPath, BOOL bDirectories,
					   BOOL bFiles, BOOL bTitle, CStringArray & EnumResults,
					   LPCTSTR* pszExclusions = NULL);
BOOL PRU_QueryDosDevice(LPCTSTR szTarget, CStringArray & Devices);
BOOL PRU_GetVolumePathNamesForVolumeName(LPCTSTR szVolName, CStringArray & PathNames);
BOOL PRU_CheckWindowsVersionMinumum(DWORD dwMajorVer, DWORD dwMinorVer);
LPWSTR GetFilePath(HANDLE hFile);
BOOL PRU_NtOpenDirectoryObject(HANDLE & hDirObj, LPCWSTR szName, HANDLE hParent, ACCESS_MASK dwAccess);
BOOL PRU_NtQueryDirectoryObject(HANDLE hDirObj, BOOLEAN bFirst, ULONG & ulIndex, CStringW & Name, CStringW & Type);
void PRU_GetAllTypeObjects(CStringArray & Names, LPCWSTR szType);
BOOL PRU_NtQuerySecurityObject(HANDLE hObject, SECURITY_INFORMATION si, CByteArray & Bytes);
BOOL PRU_CloseHandle(HANDLE hObject);

//comctl32
BOOL PRU_CheckCommonControlsVersionMinimum(DWORD dwMajorVer, DWORD dwMinorVer); //and kernel32

//advapi32
#include <winsvc.h>
class ServiceManager
{
public:
	ServiceManager() { m_hSCM = NULL; OpenServiceManager(); }
	virtual ~ServiceManager() { CloseServiceManager(); }
	BOOL OpenServiceManager();
	void CloseServiceManager();
	SC_HANDLE GetHandle() { return m_hSCM; }
private:
	SC_HANDLE m_hSCM;
};

BOOL PRU_SetPrivilege(PCTSTR name, BOOL bEnable);
BOOL PRU_FriendlyNameFromSid(PSID psid, CString & Name);
BOOL PRU_GetOwner(LPTSTR lpszPath, SE_OBJECT_TYPE ObjectType, PSID* outpsid);//and kernel32
BOOL PRU_TakeOwnership(LPTSTR lpszPath, SE_OBJECT_TYPE ObjectType, BOOL bRecurse, PSID psid = NULL);
BOOL PRU_RegOpenKey(HKEY hBaseKey, LPCTSTR szRegistryPath, HKEY & hKey);
BOOL PRU_RegCloseKey(HKEY & hKey);
BOOL PRU_WriteRegistryDWORD(HKEY hKey, LPCTSTR szRegistryValueName, DWORD dwValue);
BOOL PRU_WriteRegistryString(HKEY hKey, LPCTSTR szRegistryValueName,
							   CString ValueString, BOOL bExpandable);
BOOL PRU_WriteRegistryMultiString(HKEY hKey, LPCTSTR szRegistryValueName,
								  CStringArray & StringArray);
BOOL PRU_WriteRegistryBinary(HKEY hKey, LPCTSTR szRegistryValueName, CByteArray & ByteArray);
BOOL PRU_ReadRegistryBinary(HKEY hKey, LPCTSTR szRegistryValueName, CByteArray & ByteArray);
BOOL PRU_ReadRegistryMultiString(HKEY hKey, LPCTSTR szRegistryValueName,
								CStringArray & StringArray);
BOOL PRU_ReadRegistryString(HKEY hKey, LPCTSTR szRegistryValueName, CString & String);
BOOL PRU_ReadRegistryDWORD(HKEY hKey, LPCTSTR szRegistryValueName, DWORD & dwValue);
BOOL PRU_ReadRegistryBinary(HKEY hBaseKey, LPCTSTR szRegistryPath,
							LPCTSTR szRegistryValueName, CByteArray & ByteArray);
BOOL PRU_WriteRegistryDWORD(HKEY hBaseKey, LPCTSTR szRegistryPath,
							LPCTSTR szRegistryValueName, DWORD dwValue);
BOOL PRU_WriteRegistryString(HKEY hBaseKey, LPCTSTR szRegistryPath,
							 LPCTSTR szRegistryValueName,
							 CString ValueString, BOOL bExpandable);
BOOL PRU_WriteRegistryMultiString(HKEY hBaseKey, LPCTSTR szRegistryPath,
								  LPCTSTR szRegistryValueName,
								  CStringArray StringArray);
BOOL PRU_WriteRegistryBinary(HKEY hBaseKey, LPCTSTR szRegistryPath,
							LPCTSTR szRegistryValueName, CByteArray & ByteArray);
BOOL PRU_ReadRegistryMultiString(HKEY hBaseKey, LPCTSTR szRegistryPath,
									LPCTSTR szRegistryValueName,
									CStringArray & StringArray);
BOOL PRU_ReadRegistryString( HKEY hBaseKey, LPCTSTR szRegistryPath,
								LPCTSTR szRegistryValueName, CString & String);
BOOL PRU_ReadRegistryDWORD(	HKEY hBaseKey, LPCTSTR szRegistryPath,
								LPCTSTR szRegistryValueName, DWORD & dwValue);
BOOL PRU_RegistryEnumValues(HKEY hKey, CStringArray & Keys, BOOL bInitialize = TRUE);
BOOL PRU_RegistryEnumValues(HKEY hKey, CKVArray & KeyValues, BOOL bInitialize = TRUE);
BOOL PRU_RegistryEnumValues(HKEY hBaseKey, LPCTSTR szRegistryPath,
                               CKVArray & KeyValues, BOOL bInitialize = TRUE);
BOOL PRU_RegistryEnumKey(HKEY hKey, CStringArray & StringArray);
BOOL PRU_RegistryEnumKey(HKEY hBaseKey, LPCTSTR szRegistryPath, CStringArray & StringArray);
BOOL PRU_RegistryValueCount(HKEY hKey, DWORD &dwCount);
BOOL PRU_RegistryKeyCount(HKEY hKey, DWORD &dwCount);
BOOL PRU_RegistryKeyExists(HKEY hBaseKey, LPCTSTR szRegistryPath, BOOL& bExists);
BOOL PRU_RegDeleteKey(HKEY hKey, LPCTSTR lpSubKey);
BOOL PRU_RegDeleteTree(HKEY hBaseKey, LPCTSTR szRegistryPath);
BOOL PRU_RegDeleteValue(HKEY hKey, LPCTSTR lpValueName);
BOOL PRU_ComputeMemoryMD5(BYTE* pbBuffer, DWORD dwBufferLength, BYTE* pbMD5Hash);
BOOL PRU_ComputeFileMD5(CFile & File, BYTE* pbMD5Hash);

//shell32
void PRU_GetCommandLineLaunchArg(LPCTSTR szCmdLine, CString& String); //and kernel32
void PRU_GetShellIcon(LPCTSTR szIconPath, HICON& hIcon);

//setupapi
BOOL PRU_SetupDiGetDeviceRegistryProperty(HDEVINFO hDevInfo, PSP_DEVINFO_DATA pspDevInfoData, DWORD dwProperty, CByteArray & Bytes);
BOOL PRU_GetDeviceRegistryPropertyMultiString(HDEVINFO hDevInfo, PSP_DEVINFO_DATA pspDevInfoData, DWORD dwProperty, CStringArray & Strings);
BOOL PRU_GetDeviceRegistryPropertyString(HDEVINFO hDevInfo, PSP_DEVINFO_DATA pspDevInfoData, DWORD dwProperty, CString & String);
BOOL PRU_GetDeviceRegistryPropertyDWORD(HDEVINFO hDevInfo, PSP_DEVINFO_DATA pspDevInfoData, DWORD dwProperty, DWORD & dwValue);

typedef struct _CONFIGURATION_INFORMATION {

    //
    // This field indicates the total number of disks in the system.  This
    // number should be used by the driver to determine the name of new
    // disks.  This field should be updated by the driver as it finds new
    // disks.
    //

    ULONG DiskCount;                // Count of hard disks thus far
    ULONG FloppyCount;              // Count of floppy disks thus far
    ULONG CdRomCount;               // Count of CD-ROM drives thus far
    ULONG TapeCount;                // Count of tape drives thus far
    ULONG ScsiPortCount;            // Count of SCSI port adapters thus far
    ULONG SerialCount;              // Count of serial devices thus far
    ULONG ParallelCount;            // Count of parallel devices thus far

    //
    // These next two fields indicate ownership of one of the two IO address
    // spaces that are used by WD1003-compatable disk controllers.
    //

    BOOLEAN AtDiskPrimaryAddressClaimed;    // 0x1F0 - 0x1FF
    BOOLEAN AtDiskSecondaryAddressClaimed;  // 0x170 - 0x17F

    //
    // Indicates the structure version, as anything value belong this will have been added.
    // Use the structure size as the version.
    //

    ULONG Version;

    //
    // Indicates the total number of medium changer devices in the system.
    // This field will be updated by the drivers as it determines that
    // new devices have been found and will be supported.
    //

    ULONG MediumChangerCount;

} CONFIGURATION_INFORMATION, *PCONFIGURATION_INFORMATION;

#define DRVO_UNLOAD_INVOKED             0x00000001
#define DRVO_LEGACY_DRIVER              0x00000002
#define DRVO_BUILTIN_DRIVER             0x00000004    // Driver objects for Hal, PnP Mgr
#define DRVO_REINIT_REGISTERED          0x00000008
#define DRVO_INITIALIZED                0x00000010
#define DRVO_BOOTREINIT_REGISTERED      0x00000020
#define DRVO_LEGACY_RESOURCES           0x00000040

#define LDRP_STATIC_LINK 0x00000002
#define LDRP_IMAGE_DLL 0x00000004
#define LDRP_LOAD_IN_PROGRESS 0x00001000
#define LDRP_UNLOAD_IN_PROGRESS 0x00002000
#define LDRP_ENTRY_PROCESSED 0x00004000
#define LDRP_ENTRY_INSERTED 0x00008000
#define LDRP_CURRENT_LOAD 0x00010000
#define LDRP_FAILED_BUILTIN_LOAD 0x00020000
#define LDRP_DONT_CALL_FOR_THREADS 0x00040000
#define LDRP_PROCESS_ATTACH_CALLED 0x00080000
#define LDRP_DEBUG_SYMBOLS_LOADED 0x00100000
#define LDRP_IMAGE_NOT_AT_BASE 0x00200000
#define LDRP_COR_IMAGE 0x00400000
#define LDRP_COR_OWNS_UNMAP 0x00800000
#define LDRP_SYSTEM_MAPPED 0x01000000
#define LDRP_IMAGE_VERIFYING 0x02000000
#define LDRP_DRIVER_DEPENDENT_DLL 0x04000000
#define LDRP_ENTRY_NATIVE 0x08000000
#define LDRP_REDIRECTED 0x10000000
#define LDRP_NON_PAGED_DEBUG_INFO 0x20000000
#define LDRP_MM_LOADED 0x40000000
#define LDRP_COMPAT_DATABASE_PROCESSED 0x80000000

//
// Define the major function codes for IRPs.
//


#define IRP_MJ_CREATE                   0x00
#define IRP_MJ_CREATE_NAMED_PIPE        0x01
#define IRP_MJ_CLOSE                    0x02
#define IRP_MJ_READ                     0x03
#define IRP_MJ_WRITE                    0x04
#define IRP_MJ_QUERY_INFORMATION        0x05
#define IRP_MJ_SET_INFORMATION          0x06
#define IRP_MJ_QUERY_EA                 0x07
#define IRP_MJ_SET_EA                   0x08
#define IRP_MJ_FLUSH_BUFFERS            0x09
#define IRP_MJ_QUERY_VOLUME_INFORMATION 0x0a
#define IRP_MJ_SET_VOLUME_INFORMATION   0x0b
#define IRP_MJ_DIRECTORY_CONTROL        0x0c
#define IRP_MJ_FILE_SYSTEM_CONTROL      0x0d
#define IRP_MJ_DEVICE_CONTROL           0x0e
#define IRP_MJ_INTERNAL_DEVICE_CONTROL  0x0f
#define IRP_MJ_SHUTDOWN                 0x10
#define IRP_MJ_LOCK_CONTROL             0x11
#define IRP_MJ_CLEANUP                  0x12
#define IRP_MJ_CREATE_MAILSLOT          0x13
#define IRP_MJ_QUERY_SECURITY           0x14
#define IRP_MJ_SET_SECURITY             0x15
#define IRP_MJ_POWER                    0x16
#define IRP_MJ_SYSTEM_CONTROL           0x17
#define IRP_MJ_DEVICE_CHANGE            0x18
#define IRP_MJ_QUERY_QUOTA              0x19
#define IRP_MJ_SET_QUOTA                0x1a
#define IRP_MJ_PNP                      0x1b

// allow use in driver and application build!
// 4/8 byte alignment required for all NT structures

#define MEM_EXECUTE_OPTION_DISABLE  0x1
#define MEM_EXECUTE_OPTION_ENABLE 0x2

//#define OBJ_INHERIT              Ox00000002L
#define OBJ_PERMANENT            0x00000010L
#define OBJ_EXCLUSIVE            0x00000020L
#define OBJ_CASE_INSENSITIVE     0x00000040L
#define OBJ_OPENIF               0x00000080L
//#define OBJ_VALID_ATTRIBUTES     0x000000F2L

#define DIRTYPESTRW L"Directory"
#define DIRROOTSTRW L"\\"
#define OBJ_NAME_PATH_SEPARATOR ((WCHAR)L'\\')

#define DIRECTORY_QUERY               (0x0001) 
#define DIRECTORY_TRAVERSE            (0x0002) 
#define DIRECTORY_CREATE_OBJECT       (0x0004) 
#define DIRECTORY_CREATE_SUBDIRECTORY (0x0008) 
#define DIRECTORY_ALL_ACCESS          (STANDARD_RIGHTS_REQUIRED | 0xF) 

typedef enum _DIRECTORYINFOCLASS { 
    ObjectArray, 
    ObjectByOne 
} DIRECTORYINFOCLASS, *PDIRECTORYINFOCLASS; 

#define QUERY_DIRECTORY_BUF_SIZE 0x200 

typedef struct _OBJECT_NAMETYPE_INFO { 
	UNICODE_STRING   ObjectName; 
    UNICODE_STRING   ObjectType; 
} OBJECT_NAMETYPE_INFO, *POBJECT_NAMETYPE_INFO; 

typedef struct _CLIENT_ID {
    HANDLE UniqueProcess;
    HANDLE UniqueThread;
} CLIENT_ID;
typedef CLIENT_ID *PCLIENT_ID;
typedef DWORD KWAIT_REASON;
typedef LONG KPRIORITY;
typedef struct _VM_COUNTERS {
    SIZE_T PeakVirtualSize;
    SIZE_T VirtualSize;
    ULONG PageFaultCount;
    SIZE_T PeakWorkingSetSize;
    SIZE_T WorkingSetSize;
    SIZE_T QuotaPeakPagedPoolUsage;
    SIZE_T QuotaPagedPoolUsage;
    SIZE_T QuotaPeakNonPagedPoolUsage;
    SIZE_T QuotaNonPagedPoolUsage;
    SIZE_T PagefileUsage;
    SIZE_T PeakPagefileUsage;
} VM_COUNTERS;
typedef VM_COUNTERS *PVM_COUNTERS;

typedef struct _SYSTEM_THREAD
    {
/*000*/ FILETIME   ftKernelTime;   // 100 nsec units
/*008*/ FILETIME   ftUserTime;    // 100 nsec units
/*010*/ FILETIME   ftCreateTime;   // relative to 01-01-1601
/*018*/ DWORD    dWaitTime;
/*01C*/ PVOID    pStartAddress;
/*020*/ CLIENT_ID  Cid;        // process/thread ids
/*028*/ DWORD    dPriority;
/*02C*/ DWORD    dBasePriority;
/*030*/ DWORD    dContextSwitches;
/*034*/ DWORD    dThreadState;   // 2=running, 5=waiting
/*038*/ KWAIT_REASON WaitReason;
/*03C*/ DWORD    dReserved01;
/*040*/ }
    SYSTEM_THREAD, *PSYSTEM_THREAD;
#define SYSTEM_THREAD_ sizeof (SYSTEM_THREAD)
// -----------------------------------------------------------------
typedef struct _SYSTEM_PROCESS     // common members
    {
/*000*/ DWORD     dNext;      // relative offset
/*004*/ DWORD     dThreadCount;
/*008*/ DWORD     dReserved01;
/*00C*/ DWORD     dReserved02;
/*010*/ DWORD     dReserved03;
/*014*/ DWORD     dReserved04;
/*018*/ DWORD     dReserved05;
/*01C*/ DWORD     dReserved06;
/*020*/ FILETIME    ftCreateTime;  // relative to 01-01-1601
/*028*/ FILETIME    ftUserTime;   // 100 nsec units
/*030*/ FILETIME    ftKernelTime;  // 100 nsec units
/*038*/ UNICODE_STRING usName;
/*040*/ KPRIORITY   BasePriority;
/*044*/ DWORD     dUniqueProcessId;
/*048*/ DWORD     dInheritedFromUniqueProcessId;
/*04C*/ DWORD     dHandleCount;
/*050*/ DWORD     dReserved07;
/*054*/ DWORD     dReserved08;
/*058*/ VM_COUNTERS  VmCounters;   // see ntddk.h
/*084*/ DWORD     dCommitCharge;  // bytes
/*088*/ }
    SYSTEM_PROCESS, *PSYSTEM_PROCESS;
#define SYSTEM_PROCESS_ sizeof (SYSTEM_PROCESS)
// -----------------------------------------------------------------
typedef struct _SYSTEM_PROCESS_NT4   // Windows NT 4.0
    {
/*000*/ SYSTEM_PROCESS Process;     // common members
/*088*/ SYSTEM_THREAD aThreads [1];   // thread array
/*088*/ }
    SYSTEM_PROCESS_NT4, *PSYSTEM_PROCESS_NT4;
#define SYSTEM_PROCESS_NT4_ sizeof (SYSTEM_PROCESS_NT4)
// -----------------------------------------------------------------
typedef struct _SYSTEM_PROCESS_NT5   // Windows 2000
    {
/*000*/ SYSTEM_PROCESS Process;     // common members
/*088*/ IO_COUNTERS  IoCounters;   // see ntddk.h
/*0B8*/ SYSTEM_THREAD aThreads [1];   // thread array
/*0B8*/ }
    SYSTEM_PROCESS_NT5, *PSYSTEM_PROCESS_NT5;
#define SYSTEM_PROCESS_NT5_ sizeof (SYSTEM_PROCESS_NT5)
// -----------------------------------------------------------------
typedef union __SYSTEM_PROCESS_INFORMATION
    {
/*000*/ SYSTEM_PROCESS   Process;
/*000*/ SYSTEM_PROCESS_NT4 Process_NT4;
/*000*/ SYSTEM_PROCESS_NT5 Process_NT5;
/*0B8*/ }
    __SYSTEM_PROCESS_INFORMATION, *__PSYSTEM_PROCESS_INFORMATION;

typedef struct _RTL_DRIVE_LETTER_CURDIR { 
        USHORT Flags; 
        USHORT Length; 
        ULONG TimeStamp; 
        UNICODE_STRING DosPath; 
} RTL_DRIVE_LETTER_CURDIR, *PRTL_DRIVE_LETTER_CURDIR; 

//typedef struct __RTL_USER_PROCESS_PARAMETERS { 
//        ULONG MaximumLength; // 0x0 
//        ULONG Length; 
//        ULONG Flags; 
//        ULONG DebugFlags; 
//        PVOID ConsoleHandle; //0x10
//        ULONG ConsoleFlags; 
//        HANDLE StdInputHandle; 
//        HANDLE StdOutputHandle; 
//        HANDLE StdErrorHandle; //0x20
//        UNICODE_STRING CurrentDirectoryPath; 
//        HANDLE CurrentDirectoryHandle; 
//        UNICODE_STRING DllPath; //0x30
//        UNICODE_STRING ImagePathName; 
//        UNICODE_STRING CommandLine; //0x40
//        PVOID Environment;
//        ULONG StartingPositionLeft; 
//        ULONG StartingPositionTop; //0x50
